#include<stdio.h>
//75.灰度直方图 二维数组的使用
int main(){
	int n,m;
	scanf("%d %d",&n,&m);
	//m行 n列
	int arr[256][256];
	int res[256]={0}; 
	int i,j;
	for(i=0;i<m;i++){
		for(j=0;j<n;j++){
			scanf("%d",&arr[i][j]);
			//关键一步 
			res[arr[i][j]]=res[arr[i][j]]+1;
			//也可写成res[arr[i][j]]++;
			//理解：比如，arr[i][j]的值是8，那就是第i j个元素的灰度值是8，我们逐元素扫描，就给统计直方图里面，8这个灰度值的个数就+1，就是res[8]加1
 			//就是说res[]数组 里面初始值都是0，
			 //然后比如第2个元素(arr[0][1])灰度值为6，则res[6]就统计一次 加上1，也就是说灰度值为6的个数现在变成了1，再来一次就再加一次；
		}
	} 
	//一共15个灰度级 
	for(i=0;i<16;i++){
		//若某个结果为0，灰度个数为0，则不输出 
		if(res[i]!=0){	
			printf("%d %d\n",i,res[i]);
		}
	}
	return 0;
} 
